int/resources/objectRepo/xmlTemplates/ows/OWSReservation/req_UpdatePackages.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:res="http://webservices.micros.com/ows/5.1/Reservation.wsdl" xmlns:hot="http://webservices.micros.com/og/4.3/HotelCommon/">
	<soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="?" primaryLangID="?" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:UpdatePackagesRequest allowDOWPackage="?">
         <res:HotelReference chainCode="?" hotelCode="?"/>
         <res:ConfirmationNumber source="?" type="?"/>
         <res:LegNumber source="?" type="?"/>
         <res:ProductCode/>
         <res:Quantity/>
         <res:QuantitySpecified/>
         <res:StayDateRange>
            <hot:StartDate/>
            <hot:Duration/>
            <hot:EndDate/>
         </res:StayDateRange>
         <res:ReturnAmountInPropertyCurrency/>
      </res:UpdatePackagesRequest>
   </soapenv:Body>
</soapenv:Envelope>